# Ordenação de dados
***

A ordenação de dados é uma etapa fundamental na análise de dados, pois permite organizar as informações de forma estruturada e facilitar a compreensão dos padrões, tendências e insights presentes nos dados. A ordenação é particularmente útil quando lidamos com conjuntos de dados grandes, nos quais a visualização e interpretação das informações podem se tornar mais desafiadoras sem uma ordem adequada.

Existem várias razões pelas quais a ordenação é importante na análise de dados:

<input type="checkbox" checked disabled> **Identificação de padrões:** identifica facilmente padrões crescentes, decrescentes ou repetitivos. Esses padrões podem fornecer informações valiosas sobre o comportamento dos dados e ajudar a identificar tendências ou anomalias.

<input type="checkbox" checked disabled> **Análise comparativa:** facilita a comparação de diferentes elementos dos dados. Por exemplo, ao ordenar uma coluna de valores de vendas, podemos identificar os produtos mais vendidos ou os clientes com maior volume de compras.

<input type="checkbox" checked disabled> **Facilidade de busca:** Com os dados organizados, é mais fácil localizar informações específicas. Ao realizar buscas ou consultas em um conjunto de dados ordenado, podemos encontrar rapidamente elementos específicos, como o valor máximo, mínimo ou um intervalo específico.

<input type="checkbox" checked disabled> **Visualização mais clara:** A ordenação dos dados pode tornar a visualização mais clara e compreensível. Gráficos e tabelas podem se beneficiar de dados ordenados, fornecendo uma representação visual mais intuitiva e facilitando a interpretação dos resultados. A ordenação dos dados pode tornar a visualização mais clara e compreensível. Gráficos e tabelas podem se beneficiar de dados ordenados, fornecendo uma representação visual mais intuitiva e facilitando a interpretação dos resultados.

### Importação das bibliotecas

In [2]:
import numpy as np
import pandas as pd

### Criando  dataframe a partir de uma lista em Python

In [3]:
dados = {'Nome': ['Maria', 'João', 'Ana', 'Pedro'],
        'Idade': [25, 32, 28, 40],
        'Salário': [5000, 3000, 4500, 6000]}

df = pd.DataFrame(dados)
df

    Nome  Idade  Salário
0  Maria     25     5000
1   João     32     3000
2    Ana     28     4500
3  Pedro     40     6000

### Método sort_values
***
Este método permite ordenar um DataFrame ou uma Series com base nos valores de uma ou mais colunas. É possível especificar a ordem ascendente ou descendente e definir colunas secundárias para a ordenação.

In [5]:
df_ordenado = df.sort_values('Idade')
df_ordenado

    Nome  Idade  Salário
0  Maria     25     5000
2    Ana     28     4500
1   João     32     3000
3  Pedro     40     6000

In [7]:
# Ordenando o registro de maior para o menor valor
df.sort_values('Idade', ascending=False)

    Nome  Idade  Salário
3  Pedro     40     6000
1   João     32     3000
2    Ana     28     4500
0  Maria     25     5000

### Método sort_index
***
Este método permite ordenar um DataFrame ou uma Series com base nos índices. A ordenação é feita de forma ascendente por padrão.

In [10]:
df.sort_index()

    Nome  Idade  Salário
0  Maria     25     5000
1   João     32     3000
2    Ana     28     4500
3  Pedro     40     6000

In [11]:
df.sort_index(ascending=False)

    Nome  Idade  Salário
3  Pedro     40     6000
2    Ana     28     4500
1   João     32     3000
0  Maria     25     5000

#### Oredenando uma Series

In [8]:
s = pd.Series([3, 1, 4, 2], index=['b', 'd', 'a', 'c'])
s.head()

b    3
d    1
a    4
c    2
dtype: int64

In [9]:
s_ordenada = s.sort_index()
s_ordenada

a    4
b    3
c    2
d    1
dtype: int64

In [12]:
s.sort_index(ascending=False)

d    1
c    2
b    3
a    4
dtype: int64